package ru.acediat.feature_map

import com.yandex.mapkit.geometry.Point

val BUILDINGS = arrayListOf(
    Placemark(
        Point(55.75530513726315, 37.7075807796552),
        "Корпус Б","","ic_b.png"
    ),
    Placemark(
        Point(55.755360385178314, 37.70862013844138),
        "Корпус В", "","ic_v.png"
    ),
    Placemark(
        Point(55.75481006563854, 37.70899698596711),
        "Корпус Г","","ic_g.png"
    ),
    Placemark(
        Point(55.755933023943314, 37.7075915084909),
        "Корпус А","","ic_a.png"
    ),
    Placemark(
        Point(55.75515722017994, 37.710010860940415),
        "Корпус Д","","ic_d.png"
    ),
    Placemark(
        Point(55.755982854871554, 37.708284919317),
        "Корпус Х", "","ic_h.png"
    ),
    Placemark(
        Point(55.75636907594262, 37.70916785469349),
        "Корпус Т","","ic_t.png"
    ),
    Placemark(
        Point(55.754353, 37.706652),
        "Корпус З","","ic_z.png"
    ),
    Placemark(
        Point(55.754401, 37.707456),
        "Корпус Ж","","ic_ge.png"
    ),
    Placemark(
        Point(55.753845, 37.708241),
        "Корпус И","","ic_i.png"
    ),
    Placemark(
        Point(55.753738, 37.709396),
        "Корпус К","","ic_k.png"
    ),
    Placemark(
        Point(55.753463, 37.709783),
        "Корпус Л","","ic_l.png"
    ),
    Placemark(
        Point(55.75375022598407, 37.706759900150274),
        "Корпус Р","","ic_r.png"
    ),
    Placemark(
        Point(55.75629938859054, 37.70442299006382),
        "Корпус М","","ic_m.png"
    ),
    Placemark(
        Point(55.75717344349989, 37.703938930091795),
        "Корпус Н","","ic_n.png"
    ),
    Placemark(
        Point(55.756700419118864, 37.70340760148473),
        "Корпус Е","","ic_ee.png"
    ),
    Placemark(
        Point(55.757785822151874, 37.70558892112334),
        "Корпус Ф","","ic_f.png"
    ),
    Placemark(
        Point(55.75752408084265, 37.70239864588783),
        "Корпус С","","ic_s.png"
    ),
    Placemark(
        Point(55.758427634364715, 37.70442571913155),
        "Бассейн МЭИ","","ic_pool.png"
    ),
    Placemark(
        Point(55.76291471733196, 37.70175769707211),
        "Стадион \"Энергия\"","","ic_stadium.png"
    ),
    Placemark(
        Point(55.756516770779115, 37.70412542595837),
        "Корус Э", "", "ic_e.png"
    )
)

val FOOD = arrayListOf(
    Placemark(
        Point(55.75507394196282, 37.7082797230825),
        "Столовая №1", "Подвал корпуса В. Вход под лестницей", "ic_food.png"
    ),
    Placemark(
        Point(55.75517425267651, 37.707755437934225),
        "Буфет корпуса Б", "Корпус Б, второй этаж", "ic_food.png"
    ),
    Placemark(
        Point(55.75481136269668, 37.70898750803266),
        "Блинная", "Корпус Г, третий этаж", "ic_food.png"
    ),
    Placemark(
        Point(55.755959027608455, 37.704342341555794),
        "Harvard Cafe", "Красноказарменная 13с3", "ic_food.png"
    ),
)