package ru.acediat.feature_map

import com.yandex.mapkit.geometry.Point

val BUILDINGS = arrayListOf(
    Placemark(
        Point(55.75530513726315, 37.7075807796552),
        "Корпус Б","","ic_b.png"
    ),
    Placemark(
        Point(55.755360385178314, 37.70862013844138),
        "Корпус В", "","ic_v.png"
    ),
    Placemark(
        Point(55.75481006563854, 37.70899698596711),
        "Корпус Г","","ic_g.png"
    ),
    Placemark(
        Point(55.755933023943314, 37.7075915084909),
        "Корпус А","","ic_a.png"
    ),
    Placemark(
        Point(55.75515722017994, 37.710010860940415),
        "Корпус Д","","ic_d.png"
    ),
    Placemark(
        Point(55.755982854871554, 37.708284919317),
        "Корпус Х", "","ic_h.png"
    ),
    Placemark(
        Point(55.75636907594262, 37.70916785469349),
        "Корпус Т","","ic_t.png"
    ),
    Placemark(
        Point(55.754353, 37.706652),
        "Корпус З","","ic_z.png"
    ),
    Placemark(
        Point(55.754401, 37.707456),
        "Корпус Ж","","ic_ge.png"
    ),
    Placemark(
        Point(55.753845, 37.708241),
        "Корпус И","","ic_i.png"
    ),
    Placemark(
        Point(55.753738, 37.709396),
        "Корпус К","","ic_k.png"
    ),
    Placemark(
        Point(55.753463, 37.709783),
        "Корпус Л","","ic_l.png"
    ),
    Placemark(
        Point(55.75375022598407, 37.706759900150274),
        "Корпус Р","","ic_r.png"
    ),
    Placemark(
        Point(55.75629938859054, 37.70442299006382),
        "Корпус М","","ic_m.png"
    ),
    Placemark(
        Point(55.75717344349989, 37.703938930091795),
        "Корпус Н","","ic_n.png"
    ),
    Placemark(
        Point(55.756700419118864, 37.70340760148473),
        "Корпус Е","","ic_ee.png"
    ),
    Placemark(
        Point(55.757785822151874, 37.70558892112334),
        "Корпус Ф","","ic_f.png"
    ),
    Placemark(
        Point(55.75752408084265, 37.70239864588783),
        "Корпус С","","ic_s.png"
    ),
    Placemark(
        Point(55.758427634364715, 37.70442571913155),
        "Бассейн МЭИ","","ic_pool.png"
    ),
    Placemark(
        Point(55.76291471733196, 37.70175769707211),
        "Стадион \"Энергия\"","","ic_stadium.png"
    ),
    Placemark(
        Point(55.756516770779115, 37.70412542595837),
        "Корус Э", "", "ic_e.png"
    )
)

val FOOD = arrayListOf(
    Placemark(
        Point(55.75507394196282, 37.7082797230825),
        "Столовая №1", "Подвал корпуса В. Вход под лестницей", "ic_food.png"
    ),
    Placemark(
        Point(55.75517425267651, 37.707755437934225),
        "Буфет корпуса Б", "Корпус Б, второй этаж", "ic_food.png"
    ),
    Placemark(
        Point(55.75481136269668, 37.70898750803266),
        "Блинная", "Корпус Г, третий этаж", "ic_food.png"
    ),
    Placemark(
        Point(55.755959027608455, 37.704342341555794),
        "Harvard Cafe", "Красноказарменная 13с3", "ic_food.png"
    ),
    Placemark(
        Point(55.7545928587516, 37.70682416536444),
        "Буфет корпуса З", "Корпус З, 1 этаж", "ic_food.png"
    ),
    Placemark(
        Point(55.75432099344125, 37.70788153695788),
        "Столовая корпуса Ж", "Корпус Ж, 1 этаж", "ic_food.png"
    ),
    Placemark(
        Point(55.757563928160025, 37.702596788305435),
        "Столовая корпуса С", "Корпус С, подвал", "ic_food.png"
    ),
    Placemark(
        Point(55.75710496065111, 37.70473314883797),
        "Столовая корпуса М", "Корпус М, 7 этаж", "ic_food.png"
    ),
    Placemark(
        Point(55.758457606368495, 37.70459800887679),
        "Буфет бассейна МЭИ", "Энергетический проезд, 3с3", "ic_food.png"
    ),
    Placemark(
        Point(55.7589754979577, 37.704265333110875),
        "ШаурмаRoom", "ул. Лефортовский Вал, 9А", "ic_food.png"
    ),
    Placemark(
        Point(55.758922461186366, 37.70299284827477),
        "Столовая №5", "Лефортовский вал, 7Гс5", "ic_food.png"
    ),
    Placemark(
        Point(55.755363149795606, 37.71220591743944),
        "МТУСИ", "Столовые на 1 и 2 этажах", "ic_food.png"
    ),
)

val HOSTELS = arrayListOf(
    Placemark(
        Point(55.757592807539666, 37.71251938197126),
        "18-ое общежитие", "В прстонародье \"Восемнашка\". Адрес: Энергетическая 18", "ic_hostel.png"
    ),
    Placemark(
        Point(55.75919366494219, 37.708115743126015),
        "14-ое общежитие", "Энергетическая 14", "ic_hostel.png"
    ),
    Placemark(
        Point(55.75982111186059, 37.70607991860953),
        "10-ое общежитие", "Энергетическая 10к1", "ic_hostel.png"
    ),
    Placemark(
        Point(55.76071560845507, 37.70388397307053),
        "6-ое общежитие", "Энергетическая 6", "ic_hostel.png"
    ),
    Placemark(
        Point(55.76650811646031, 37.70495624790852),
        "Синичка 1А", "1-ая Синичкина 3к1А", "ic_hostel.png"
    ),
    Placemark(
        Point(55.766054589564746, 37.70547032712156),
        "Синичка 1", "1-ая Синичкина 3к1", "ic_hostel.png"
    ),
)